app/services/create_account_service.rb

  def create_account
    if @info_injection_book_id.present?
      user_code = generate_user_code("PARENT-")
      Account.create! user_code: user_code, password: ENV["INIT_ACCOUNT_PASSWORD"],
        info_injection_book_id: @info_injection_book_id, role_id: Settings.active_record.account.role.user
    else
      user_code = generate_user_code("STAFF-")
      Account.create! user_code: user_code, password: ENV["INIT_ACCOUNT_PASSWORD"],
        details_info_id: @details_info_id, role_id: Settings.active_record.account.role.staff
---
INSERT INTO `accounts` (`user_code`, `info_injection_book_id`, `encrypted_password`) VALUES ('parent-40932', 17, '$2a$11$QgMti47RH47MNp7yjnHF0.MtHCSu7XeAxjiUgT6n.P3uxTSEYhTae')
INSERT INTO `accounts` (`user_code`, `details_info_id`, `encrypted_password`) VALUES ('staff-17583', 3, '$2a$11$5KwFu6z.qfyyiy1wOn8nsOnOw8JoYMs8qApoWd1BnH08/BaEDoHri')

  def generate_user_code(code)
    source = (0..9).to_a
    user_code = code
    5.times{ user_code += source[rand(source.size)].to_s }
    account = Account.find_by user_code: user_code
    while account.present? do
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`user_code` = 'STAFF-17583' LIMIT 1
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`user_code` = 'STAFF-14895' LIMIT 1