app/controllers/admin/companies_controller.rb

SELECT  `companies`.* FROM `companies` WHERE (company_code LIKE '%1997%' OR name LIKE '%1997%') LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `companies`
---
  def index
    @companies = Company.match_query(params[:query]).page(params[:page])

INSERT INTO `companies` (`company_code`, `name`, `address`) VALUES ('ddd1997', '1997ddd', '29dd')
SELECT  `companies`.* FROM `companies` ORDER BY `created_at` DESC LIMIT 15 OFFSET 0
---
  def create
    @company = Company.new company_params
    respond_to do |format|
      if @company.save
        @companies = Company.page(params[:page])

UPDATE `companies` SET `company_code` = '2 codek' WHERE `companies`.`id` = 2
SELECT  `companies`.* FROM `companies` LIMIT 15 OFFSET 0
---
  def update
    respond_to do |format|
      if @company.update company_params
        @companies = Company.page(params[:page])

DELETE FROM `companies` WHERE `companies`.`id` = 31
---
  def destroy
    @company.destroy

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def set_company
    @company = Company.find params[:id]