app/controllers/user/accounts_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
---
  def load_account
    @account = Account.find params[:id]