app/controllers/user/details_infos_controller.rb

  def create
    @details_info = DetailsInfo.new details_info_params
    if @details_info.save
      CreateAccountService.new(details_info_id: @details_info.id).create_account
---
INSERT INTO `details_infos` (`first_name`, `last_name`, `email`, `identify`, `number_phone`, `permanent_address`, `current_address`, `bank`, `bank_account_number`, `language`, `certificate`, `experience`, `nationality`, `gender`, `tax_code`, `vaccination_center_id`, `department_id`) VALUES ('Nguyễn Thị', 'Thảo', 'fsdffds@gmail.com', '121212121212', '3333333333333333', '', '', '', '', '', '', '', '', 'female', '', 1, 1)
INSERT INTO `accounts` (`user_code`, `details_info_id`, `encrypted_password`) VALUES ('staff-17583', 3, '$2a$11$5KwFu6z.qfyyiy1wOn8nsOnOw8JoYMs8qApoWd1BnH08/BaEDoHri')