app/controllers/user/info_injection_books_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`info_injection_book_id` = 8 LIMIT 1
---
  def index
    @info_injection_books = InfoInjectionBook.includes(:account).newest.filter_info_injection_books(params[:query]).page(params[:page])

INSERT INTO `info_injection_books` (`father_name`, `identify_father`, `mother_name`, `identify_mother`, `number_phone`, `current_address`, `permanent_address`, `email`) VALUES ('Hihisdsad', '', 'dfsafsfas', '', '038974639723', '', '', 'fkjdczxczxjf@kdfkds.com')
INSERT INTO `injection_books` (`name_person_injected`, `date_of_birth`, `place_of_birth`, `info_injection_book_id`, `gender`) VALUES ('Nguyễn Thị Phương Thảo', '2018-03-22 00:00:00', 'dddddddddddddddddddddddd', 14, 1)
---
  def create
    @info_injection_book = InfoInjectionBook.new info_injection_book_params
    respond_to do |format|
      if @info_injection_book.save

SELECT  `info_injection_books`.* FROM `info_injection_books` WHERE `info_injection_books`.`id` = 10 LIMIT 1
---
  def load_info_injection_book
    @info_injection_book = InfoInjectionBook.find params[:id]