app/controllers/user/injection_books_controller.rb

SELECT  `injection_books`.* FROM `injection_books` WHERE `injection_books`.`info_injection_book_id` = 16 ORDER BY `injection_books`.`id` DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `injection_books`
---
  def index
    if current_user_account.is_user?
      @injection_books = current_user_account.info_injection_book.injection_books.newest.page(params[:page])

INSERT INTO `injection_books` (`name_person_injected`, `date_of_birth`, `place_of_birth`, `info_injection_book_id`) VALUES ('Nguyen Hoa Hoa', '2019-03-11 00:00:00', ',sajdn,asdn,asjdlksadmas,dá', 21)
---
  def create
    @injection_book = current_user_account.info_injection_book.injection_books.build injection_book_params
    if @injection_book.save

SELECT  `info_injection_books`.* FROM `info_injection_books` WHERE `info_injection_books`.`id` = 6 LIMIT 1
---
  def load_injection_book
    @injection_book = InjectionBook.find params[:id]