app/views/user/details_infos/new.html.erb

                        </div>
                        <%= f.select :vaccination_center_id, options_for_select(VaccinationCenter.pluck(:code, :id)), {}, class: "form-control bg-light border-1", required: true %>
---
SELECT `vaccination_centers`.`code`, `vaccination_centers`.`id` FROM `vaccination_centers`

                        </div>
                        <%= f.select :department_id, options_for_select(Department.pluck(:name, :id)),{}, class: "form-control mdb-select md-form", required: true %>
---
SELECT `departments`.`name`, `departments`.`id` FROM `departments`