app/models/injection_book.rb

  def generate_book_code
    source = (0..9).to_a
    book_code = "INB"
    5.times{ book_code += source[rand(source.size)].to_s }
    self.book_code = book_code
    self.save!
---
UPDATE `injection_books` SET `book_code` = 'VAC03657' WHERE `injection_books`.`id` = 5